Lemeroy/iot_design/firmware_esp32/sdkconfig.defaults
# ==== 卒中卫士 M1a sdkconfig 默认值 (v0.2, 无 tinyusb 依赖) ====
# 目标板: ESP32-S3-WROOM-1 (N16R8) - 16MB Flash / 8MB OPI PSRAM
# IDF: v5.5.3

# ---- 芯片 & 时钟 ----
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ=240

# ---- Flash 16MB ----
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="16MB"
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y

# ---- PSRAM 8MB OPI (N16R8 关键项) ----
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_TYPE_AUTO=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_USE_MALLOC=y
CONFIG_SPIRAM_TRY_ALLOCATE_WIFI_LWIP=y

# ---- 分区表 ----
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# ---- USB Serial JTAG: 单 CDC, 数据+日志共用 ----
# esp_log 默认输出到 UART/USB console, 此配置让它走 USB Serial JTAG
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG_ENABLED=y
CONFIG_USJ_ENABLE_USB_SERIAL_JTAG=y

# ---- WiFi + CSI ----
CONFIG_ESP_WIFI_CSI_ENABLED=y
CONFIG_ESP_WIFI_ENABLE_WPA3_SAE=y
CONFIG_ESP_WIFI_STATIC_RX_BUFFER_NUM=16
CONFIG_ESP_WIFI_DYNAMIC_RX_BUFFER_NUM=32
CONFIG_ESP_WIFI_TX_BUFFER_TYPE=1
CONFIG_ESP_WIFI_DYNAMIC_TX_BUFFER_NUM=32

# ---- 用户需修改: 烧录前 `idf.py menuconfig` -> "StrokeGuard M1a Config" ----
CONFIG_STROKEGUARD_WIFI_SSID="YOUR_SSID"
CONFIG_STROKEGUARD_WIFI_PASSWORD="YOUR_PASS"
CONFIG_STROKEGUARD_DEVICE_ID="sg-0001"
CONFIG_STROKEGUARD_MQTT_URI=""
CONFIG_STROKEGUARD_MQTT_USERNAME=""
CONFIG_STROKEGUARD_MQTT_PASSWORD=""
CONFIG_STROKEGUARD_PROFILE_AGE=0
CONFIG_STROKEGUARD_PROFILE_GENDER="other"
CONFIG_STROKEGUARD_MANAGER_PORT=80
CONFIG_STROKEGUARD_MANAGER_TOKEN=""
CONFIG_STROKEGUARD_LEGACY_USB_STREAM=n

# ---- FreeRTOS ----
CONFIG_FREERTOS_HZ=1000
CONFIG_FREERTOS_UNICORE=n

# ---- 日志 ----
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_LOG_MAXIMUM_EQUALS_DEFAULT=y

# ---- 看门狗 ----
CONFIG_ESP_TASK_WDT_TIMEOUT_S=10
CONFIG_ESP_TASK_WDT_EN=y
